       IDENTIFICATION DIVISION.
       PROGRAM-ID. genie.
       AUTHOR. genial.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT F-OUTPUT ASSIGN TO "intelligence"
       ORGANIZATION IS LINE SEQUENTIAL
       ACCESS MODE IS SEQUENTIAL
       FILE STATUS IS FS-OUTPUT.

